package com.example.administrator.aitang.bean.lianxi;

import java.io.Serializable;
import java.util.List;

/**
 * Author : wangzexin
 * Date : 2017/12/10
 * Describe :
 */

public class PiGaiDetailBean {


    /**
     * code : 200
     * data : [{"content":"di6ti","img":["http://55.irapidtech.net/Public/upload/data2017/12/05/fb42bb0a57cf7ff81f5f9d62281043e5.jpeg"],"qid":"122","des":"&lt;p&gt;请问&lt;/p&gt;","questionintro":[["\u201c给定资料5\u201d介绍了汉代王景治理黄河的思路和做法。请概括王景治河后黄河安澜800年的主要原因。"],["要求：简明扼要，条理清楚。不超过200字。"],["材料5"],["东汉永平十二年，孝明帝令水利专家王景治黄(此前黄河已泛滥几十年)。王景受命于危难之际，率几十万兵士民工，修汴渠治黄河，历时一年，用费亿钱。自王景治河后，河行新道，维持了900多年未发生大改道，是时，汴渠成为东通江淮的主要水道。王景的主要工作是修建了自荥阳至千乘的黄河大堤，治理了作为东汉漕运主要通道的汴渠。王景治河后，黄河相对安澜800年，据分析与王景所选定的东汉故道河身较短、地势较低，因而行河路线较优有关；另外，\u201c十里立一水门，令更相回注\u201d所描述的可能是一种利用沿河大泽放淤的工程措施，这对于延长行河年限也有一定作用。以上所述主要是从治黄工程的角度看问题，但据黄河水文、植保专家的研究，王景治河至隋代的500多年间，为黄河史上又一阶段，其特点是黄河下游河患相对较少，在此期间，黄河中游地区大暴雨的记录较少，这一时期黄河下游有分支，两侧又有较多湖泊洼地；但其中更重要的原因就是那时黄河输沙量的减少，否则，王景所开新河道(如汴水)，也会很快被淤积，从而使河床不断淤高，降低其泄洪能力。这一时期黄河输沙量的减少并不是推论，而是有以下诸条事实，即在这一时期有关黄河水清的记载较多，且有\u201c黄河清复清\u201d的民谣。这一时期黄河输沙量的减少主要归因于黄土高原人口减少，植被得到一定恢复。安史之乱后，农牧界线又迅速北移到河套以北，大片草原又变为农田，又一次加剧了水土侵蚀，黄河下游灾害增多。五代、两宋至元、明时期，农牧界线一直游移于陕北和内蒙古之间，直至清乾隆之后，农田植被更逐渐推移至阴山以北，这时整个草原几乎全部为当年生栽培作物所取代，水土流失非常严重，陕北风沙加剧，黄河下游水患频繁。王景治河后黄河安澜800年，他的治黄思路和做法很值得今人研究与借鉴。"]]},{"content":"di7ti\n","img":["http://55.irapidtech.net/Public/upload/data2017/12/05/cfc8369b429218c2e124fa8931b78084.jpeg","http://55.irapidtech.net/Public/upload/data2017/12/05/8dd743abcf9ba1134d6133d5d574b7ec.jpeg"],"qid":"123","des":"&lt;p&gt;请问&lt;/p&gt;","questionintro":[["阅读\u201c给定资料2\u201d，概括全国\u201c两会\u201d代表委员们所关注的若干问题，及其所给出的具体建议。"],["要求：全面、准确、简明，不超过200字。"],["材料2："],["中国自古是礼仪之邦，诚信知理、与人为善是中华民族引以为荣的优良传统。如今，中国正处于经济中高速持续发展的重要时期，物质财富的日渐丰富，给社会风气带来了一定影响。为此，我们迫切需要进一步加强社会主义精神文明建设，提升软实力。"],["习近平总书记在会见全国文明城市、文明村镇、文明单位和未成年人思想道德建设工作先进代表时指出，要大力加强社会公德、职业道德、家庭美德、个人品德建设，营造全社会崇德向善的浓厚氛围。"],["近来，国人的不文明行为屡被曝光。如何引导和推动全体人民树立文明观念、争当文明公民、展示文明形象，成为近年来全国\u201c两会\u201d不少代表委员关注的话题，他们从各自的角度给出建议。"],["\u201c书香社会\u201d的提法\u201c亮相\u201d政府工作报告。全国人大代表Y在接受记者采访时说，她对李克强总理在政府工作报告中提到的\u201c倡导全民阅读，建设书香社会\u201d特别赞同。读书能让人的心静下来。要提升国人的文明素质，提升国人在海外的形象，倡导全民阅读十分必要。"],["Y","说，现在的道德教育多是口号，人们不喜欢。用阅读潜移默化地熏陶国民，效果会更好。现在，大城市的图书馆不够多，中小城市和县城的图书馆更少，人们想读书，但没地方读。因此她建议各地多建一些图书馆。"],["全国人大代表w认为，今天到处都是低头族，他们看手机、刷微博、看微信，真正读书的人太少了。如果一个民族没有文化知识做支撑，将来无论做什么都会有局限性，厚度不够。"],["W","说，她今年带来一个关于制定图书馆法的议案。欧美一些国家规定，社区方圆十公里之内一定要有一个图书馆，创造条件引导人们阅读。我们也应当营造这样的环境。大学里面有非常好的图书馆，应该让公众共享。"],["全国政协委员T在接受记者采访时表示，文明缺失等现象是存在的，但他相信情况会渐渐变好。很多人在国外看到同胞的不文明行为时，都会感到很难为情。一些人出国后的表现像暴发户，大声喧哗，随地吐痰，甚至做出其他不文明的事。要改变这种状况，需要一个过程，需要国民在接受社会文明素养教育的同时，不断加强自身文明修养，领导干部、公众人物尤其要做好表率，起到示范作用。"],["全国政协委员G建议，应当传承和发扬优秀传统文化，擦亮国人\u201c礼仪名片\u201d，使社会主义核心价值观与人们的曰常生活紧密联系起来，在落小、落细、落实上下功夫。"],["G","指出，目前社会上出现不少违反传统礼仪规范的现象，如父慈子孝蜕化成纯金钱性的抚养和赡养义务，邻里和睦蜕化成老死不相往来的\u201c家&nbsp;"],["习近平总书记说，要把精神文明建设贯穿改革开放和现代化全过程、&nbsp;"],["全国政协委员K说，在大学工作多年，他发现在大学生中社会责任感缺失，对家庭缺乏情感关怀等现象越来越突出。K认为，孝敬父母是最基础的道德教育。他建议，以大学生作为弘扬优秀孝文化的突破口，借鉴中国传统\u201c孝文化\u201d中的积极因素，培养大学生的孝德之心、仁爱之心，在高校开设孝道教育的国学课程，将传统孝文化列入公选课内容，增强大学生的孝道意识。同时，大力开展以\u201c孝爱\u2019\u2019为主题的教育活动，引导学生从我做起，从小事做起，自觉在言行中体现孝爱美德。"],["W","认为，文化艺术发展和创新的根本，是人才的培养。教育部颁布了新的文件，要求学生从中学开始，都要具有音乐和美术的基础知识，这非常好。从孩子抓起，这对提升整个国民的文化素质是一个非常有力的举措。他引用了欧洲一位哲学家的话：&nbsp;"]]}]
     */

    private String code;
    private List<DataBean> data;

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean implements Serializable{
        /**
         * content : di6ti
         * img : ["http://55.irapidtech.net/Public/upload/data2017/12/05/fb42bb0a57cf7ff81f5f9d62281043e5.jpeg"]
         * qid : 122
         * des : &lt;p&gt;请问&lt;/p&gt;
         * questionintro : [["\u201c给定资料5\u201d介绍了汉代王景治理黄河的思路和做法。请概括王景治河后黄河安澜800年的主要原因。"],["要求：简明扼要，条理清楚。不超过200字。"],["材料5"],["东汉永平十二年，孝明帝令水利专家王景治黄(此前黄河已泛滥几十年)。王景受命于危难之际，率几十万兵士民工，修汴渠治黄河，历时一年，用费亿钱。自王景治河后，河行新道，维持了900多年未发生大改道，是时，汴渠成为东通江淮的主要水道。王景的主要工作是修建了自荥阳至千乘的黄河大堤，治理了作为东汉漕运主要通道的汴渠。王景治河后，黄河相对安澜800年，据分析与王景所选定的东汉故道河身较短、地势较低，因而行河路线较优有关；另外，\u201c十里立一水门，令更相回注\u201d所描述的可能是一种利用沿河大泽放淤的工程措施，这对于延长行河年限也有一定作用。以上所述主要是从治黄工程的角度看问题，但据黄河水文、植保专家的研究，王景治河至隋代的500多年间，为黄河史上又一阶段，其特点是黄河下游河患相对较少，在此期间，黄河中游地区大暴雨的记录较少，这一时期黄河下游有分支，两侧又有较多湖泊洼地；但其中更重要的原因就是那时黄河输沙量的减少，否则，王景所开新河道(如汴水)，也会很快被淤积，从而使河床不断淤高，降低其泄洪能力。这一时期黄河输沙量的减少并不是推论，而是有以下诸条事实，即在这一时期有关黄河水清的记载较多，且有\u201c黄河清复清\u201d的民谣。这一时期黄河输沙量的减少主要归因于黄土高原人口减少，植被得到一定恢复。安史之乱后，农牧界线又迅速北移到河套以北，大片草原又变为农田，又一次加剧了水土侵蚀，黄河下游灾害增多。五代、两宋至元、明时期，农牧界线一直游移于陕北和内蒙古之间，直至清乾隆之后，农田植被更逐渐推移至阴山以北，这时整个草原几乎全部为当年生栽培作物所取代，水土流失非常严重，陕北风沙加剧，黄河下游水患频繁。王景治河后黄河安澜800年，他的治黄思路和做法很值得今人研究与借鉴。"]]
         */

        private String content;
        private String qid;
        private String des;
        private List<String> img;
        private List<List<String>> questionintro;

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        public String getQid() {
            return qid;
        }

        public void setQid(String qid) {
            this.qid = qid;
        }

        public String getDes() {
            return des;
        }

        public void setDes(String des) {
            this.des = des;
        }

        public List<String> getImg() {
            return img;
        }

        public void setImg(List<String> img) {
            this.img = img;
        }

        public List<List<String>> getQuestionintro() {
            return questionintro;
        }

        public void setQuestionintro(List<List<String>> questionintro) {
            this.questionintro = questionintro;
        }
    }
}
