package com.example.administrator.aitang.bean.lianxi;

import java.util.List;

/**
 * Author : wangzexin
 * Date : 2017/11/14
 * Describe :
 */

public class ZhiNengZuJuanBean {


    /**
     * code : 200
     * data : [{"qid":"33","qcid":"1","qctypeid":"1","qtpath":"0-4-20-76","qtitle":"zxtc","qtid":"76","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["①中国是玉米主要生产国之一，栽培面积和总产量仅次于美国"],["②玉米营养丰富，是农作物中热量最高的粮食，人们称之为\u201c饲料作物之王\u201d"],["③明末清初中国人口从1亿增至4亿，玉米功不可没"],["④现今，全世界约70%的玉米用以发展畜牧业，以换取肉、奶、蛋等生活必需品"],["⑤学者曾把人均玉米数量视为一个国家畜牧业发展和人民生活水平的重要标志"],["⑥明末清初时玉米传入中国，许多无法种植小麦的早旱、贫瘠之地也可开垦种植玉米，且产量比小麦高"],["将以上6个句子重新排列，语序正确的是："]],"qanswer":[["A.","⑥③④①②⑤"],["B.","①②④③⑥⑤"],["C.","②④⑤①⑥③"],["D.","④⑤②①③⑥"]],"qerror":"A","qsuccess":"C","playnum":"0","successnum":"0","qdes":[["【思路点拨】本题是一道语句排序题。做题时需要从观察选项入手，然后猜定选项，最后验证猜定选项连贯性。常用的方法有判断首句、绑定选项和注意文章写作顺序等。"],["【选项解析】"]],"qdegree":"50","time":"1507619057","come":"历年真题","kaodian":"语句排序题","accuracy":"100"},{"qid":"41","qcid":"1","qctypeid":"1","qtpath":"0-4-21","qtitle":"根据文章，下列说法正确的是：","qtid":"21","areaid":"1","qtgroup":"5","qtype":"2","qcontent":[["技术为自身的生存和发展而战，并且有着独特的生命周期。我们可以将其划分为以下几个阶段："],["首先是先驱阶段。技术的先决条件已经存在，梦想家们可能会考虑把这些元素放在一起。然而即便这些梦想此时已经记录在案，人们也不会将其视为发明创造，比如达·芬奇曾经绘制过很多有说服力的飞机和汽车图画，但人们并不认为他是在发明创造。"],["其次是发明阶段。这一阶段在人类文化当中相当有名。此一阶段时间比较短，从某些方面来看，这就像________________________。在这个阶段当中，发明家们把科学技术、好奇心与决心结合起来，通常再加上一定的表演技巧，将各种方法以新的方式结合在一起，给生活带来一种全新的技术。"],["第三个阶段是发展阶段。新发明会得到那些溺爱它们的监护者（也许还包括最初的发明者）的保护和支持。通常这一阶段比发明阶段要重要，可能还包括额外的创造，这些额外创造比那个独创性发明更重要。当年，许多工匠已经手工制作了非常精美的老式汽车，但使汽车产业得以生根发芽、枝繁叶茂的，却是美国企业家亨利·福特推出的大批量生产的创新做法。"],["第四个阶段是成熟期。技术在不断进步，现在已经有了自己的生命，也终于成为社会当中独立稳定的部分，也许已经深入人类生活的方方面面。因此许多观察家认为，技术将永存于世。"],["在下一个阶段（可称为\u201c挑战者时期\u201d）到来时，这种状态会发生有趣的变化。技术界的\u201c新贵\u201d威胁着要排挤那些老技术，其追随者过早宣布了胜利的消息。但是尽管新技术能带来一些独特的益处，仔细思考之后人们却发现，这些新技术在功能和质量方面存在着关键元素缺失的问题。当人们发现这些新技术确实无法改变既有秩序之后，技术的保守派便以此为依据，证明以前的技术方法确实可以永存。"],["对逐渐老化的技术来说，这通常只是一个短暂的胜利。另一种新技术很快就会出现，它总能成功地将原有技术逼到过时的舞台上。在生命周期的这个部分，技术在逐渐衰败的状态当中度过了晚年，它的最初目的和功能现在都被一个更活泼的竞争对手比下去了。这一阶段约占技术整个生命周期的","5%","至","10%","。"],["最终，技术成为\u201c老古董\u201d，就像马赫轻便马车、拨弦键琴、机电式计算器一样，不得不黯然离场。"]],"qanswer":[["A","．技术的成熟期持续时间较短"],["B","．关键元素的缺失会导致技术停滞不前"],["C","．\u201c老古董\u201d指技术已臻于完美，无需改进"],["D","．\u201c短暂的胜利\u201d指原有技术的胜利"]],"qerror":"A","qsuccess":"D","playnum":"0","successnum":"0","qdes":[["【思路点拨】本题是一道细节查找题。重点考察考生认真细致阅读的能力，做题时首先需要看清提问方式，是选符合的还是不符的；其次就是要四个选项与文章一一对应，选择答案；第三，某些细节题选择答案时可能会存在优选的情况，即各个选项都会存在不同程度的瑕疵，这时优选最符合的或最不符合的。本题选择的为\u201c","与原文符合的","\u201d。"],["【选项解析】A选项\u201c技术成熟期时间短\u201d在文中没有提及，属于无中生有；B选项无中生有，文中没有这一层逻辑关系，只是说\u201c","这些新技术在功能和质量方面存在着关键元素缺失的问题。对逐渐老化的技术来说，这通常只是一个短暂的胜利\u201d；C选项\u201c老古董\u201d的结局是\u201c黯然离场\u201d，而不是完美无需改进；D选项表述正确，对应文章\u201c对逐渐老化的技术来说，这通常只是一个短暂的胜利\u201d。故本题正确答案为D选项。"]],"qdegree":"50","time":"1509341922","come":"历年真题","kaodian":"篇章阅读","accuracy":"100"},{"qid":"98","qcid":"1","qctypeid":"1","qtpath":"0-1-83","qtitle":"zxtc","qtid":"83","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["艾滋病被称为\u201c","20","世纪的瘟疫\u201d，艾滋病病毒以人体内的（","&nbsp;&nbsp;&nbsp;&nbsp;","）作为攻击目标。"]],"qanswer":[["A.","红细胞"],["B.","血红蛋白"],["C.","淋巴细胞"],["D.","神经系统"]],"qerror":"D","qsuccess":"C","playnum":"0","successnum":"0","qdes":[["艾滋病全称为获得性免疫缺陷综合征（","AIDS","），是由一种名为\u201c人类免疫缺陷病毒（","HIV","）所导致的疾病。艾滋病病毒（","HIV","）是一种能生存于人的血液中并攻击人体免疫系统的病毒。它把人体免疫系统中最重要的","T4","淋巴细胞作为攻击目标，大量破坏","T4","淋巴细胞，从而使整个人体免疫系统遭到破坏，最终人体丧失对各种疾病的抵抗能力而导致死亡。因此本题选","C"],["人体血液中主要的成分及其功能如下"],["1","、红细胞：更新周期","120","天，负责将肺部呼吸的氧气携带到全身各部位，再将全身各部位的细胞产生的二氧化碳带回肺部排出体外。在红细胞中能够与氧气、二氧化碳结合的是血红蛋白，血红蛋白中含有铁元素，这也是血液呈现红色的原因"],["2","、血小板：不是一种细胞，只是一种碎片形式的功能成分。当皮肤或血管壁出现破损的时候，血小板就会聚集到破损处，并与凝血因子、胶原蛋白等功能成分共同组成网状结构，封闭出血点，起到止血的效果"],["3","、","T","细胞：主要分为","T4","和","T8","两类，负责细胞免疫，这两种细胞可以识别外源入侵物，包括细菌、病毒、花粉等，并通过释放免疫因子、杀伤受感染的细胞来保护人体免受感染"],["4","、","B","细胞：负责体液免疫，在","T","细胞释放的免疫因子的作用下，","B","细胞特异识别外源入侵物，大量合成抗体，抗体可以结合细菌、病毒等物质，使它们不再流动，也就不会在对人体造成损害"],["5","、粒细胞、吞噬细胞：负责吞噬、清除血液中的各种杂质，包括被裂解的细胞碎片、抗体","-","病毒复合物等"]],"qdegree":"50","time":"1507703766","come":"历年真题","kaodian":"生物与医学","accuracy":"100"},{"qid":"104","qcid":"1","qctypeid":"1","qtpath":"0-1-84","qtitle":"zxtc","qtid":"84","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["高压锅能更快煮熟饭菜的主要原因是（","&nbsp;&nbsp;&nbsp;","）。"]],"qanswer":[["A.","防止散热"],["B.","加强热传递"],["C.","加强热对流"],["D.","增大锅内压强，提高沸点"]],"qerror":"A","qsuccess":"D","playnum":"0","successnum":"0","qdes":[["压强越大，水的沸点就越高。在一般条件下，水在沸腾之后就不会继续升温。而高压锅内的压强增大了，水的沸点就高了，水就可以一直升温升到这个压强下水的沸点。而这个沸点是大于","100","摄氏度的。温度越高，煮熟饭菜就越快了。所以选择","D","选项"],["压强是表示压力作用效果（形变效果）的物理量。在国际单位制中，压强的单位是帕斯卡，简称帕（这是为了纪念法国科学家帕斯卡而命名的），即牛顿","/","平方米。压强的常用单位有千帕、千克力","/","平方厘米、托。一般以英文字母「","pa","」表示"]],"qdegree":"50","time":"1507705068","come":"历年真题","kaodian":"物理化学","accuracy":"100"},{"qid":"127","qcid":"1","qctypeid":"1","qtpath":"0-10-16","qtitle":"zxtc","qtid":"16","areaid":"1","qtgroup":"-1","qtype":"3","qcontent":[["请结合\u201c给定资料7\u20148\u201d，分析比较F市、T市生活垃圾收费制度的不同之处。"],["要求：全面、深入，逻辑清晰，不超过350字。"],["材料7:"],["F","市城区现行的生活垃圾收费制度，是2003年5月1日开始实施的。生活垃圾处理费征收工作由市城市管理执法局负责组织协调，各区政府配合，市环境卫生管理处负责具体实施。"],["征收对象为辖区的所有市民和单位。征收标准为：常住人口6元/（户\u2022月）；集体宿舍、单身公寓和外来人员5元/(人\u2022月）（家庭独立租住视同常住人口收取）；对上门收集生活垃圾的，另外缴纳有偿服务费2元/（户\u2022月）。已缴纳物业管理服务费的，只缴纳3元/（户\u2022月）。机关、事业单位及社会团体按在职职工人数（含固定工，临时工）2元/（人\u2022月）（不含内部生活垃圾的清扫、运输费）；门前卫生责任区有偿服务费缴纳1元/（m2\u2022月），每月不足20元的按20元缴纳，超过1000元的按1000元缴纳。已缴纳物业管理费的，只收取前项垃圾处理费等等。"],["制度规定，凡弄虚作假或拒不缴费的单位和个人，由环境卫生行政主管部门责令其改正并处以罚款。当事人对行政处罚决定不服的，可依法申请行政复议或提起行政诉讼。逾期不申请行政复议或提起行政诉讼、又不履行行政处罚决定的，由作出行政处罚决定的行政机关依法申请人民法院强制执行。"],["有资料显示，F市生活垃圾日产生量2001年为1400吨，2007年为1900吨。2006年，F市家庭垃圾费支出占家庭可支配收入的比例为0.17%。2007年，F市共征收垃圾处理费3085万元，但收缴率仅为79.1%。"],["材料8："],["T","市2000年7月开始实施垃圾费\u201c随袋征收\u201d政策，即垃圾处理费采用销售专用垃圾袋方式征收，专用垃圾袋售价内含垃圾费，凡以专用垃圾袋盛装的垃圾，清洁队才予以清理，但资源回收物可以免费交给清洁队回收。"],["该制度由市环保局组织实施。市环保局负责垃圾袋专用权及其规格、样式、容积公告；组织委托厂家生产；委托超市或商店销售专用垃圾袋；监测和惩处非法丢弃垃圾、非法生产和销售专用垃圾袋等行为。征收对象为辖区内产生生活垃圾的所有市民和单位。"],["政策规定：\u201c环保局应依据本市垃圾焚化炉正常营运时一般废弃物清除处理总成本及现有焚化炉处理总容量，计算随袋单位容积清理费收费标准，报请市政府核定公告后，订定专用垃圾袋售价\u201d。经过复杂的程序以后，计算出每包专用垃圾袋的售价如下表："],["&nbsp;"],{"0":"&nbsp;","small":["http://localhost/Public/upload/image/201710/1507707661128604.png?width=&height="]},["政策强调，专用垃圾袋为清理费收费专用，未经环保局同意不得擅自制作、销售，并不得使用袋上图样及文字。伪造、变造或擅自销售（包括擅自提价销售）专用垃圾袋者，都要处以罚款。逾期不缴纳罚款者或涉及刑事责任者，依法移送司法机关处理。"],["有资料显示，T市生活垃圾日产生量1999年为3000吨，2005年为1400吨。资源回收率由1999年的2.4%提高到2005年的34.5%。T市家庭垃圾费支出占家庭可支配收入的比例1999年为0.15%，2004年为0.05%。2001年非法丢弃垃圾率仅为0.4%。"]],"qanswer":"zxtc","qerror":"zxtc","qsuccess":"zxtc","playnum":"0","successnum":"0","qdes":"zxtc","qdegree":"50","time":"1507707715","come":"历年真题","kaodian":"分析题","accuracy":"100"},{"qid":"147","qcid":"1","qctypeid":"1","qtpath":"0-10-19","qtitle":"zxtc","qtid":"19","areaid":"1","qtgroup":"-1","qtype":"3","qcontent":[["（2014年国考地市级）加拿大女作家门罗曾经说过：\u201c幸福始终充满着缺陷。\u201d请结合你对给定资料的思考和对这句话的领悟，自拟题目，写一篇文章。（40分）"],["要求：（1）自选角度，立意明确；（2）联系实际，不拘泥于\u201c给定资料\u201d；（3）思路清晰，语言流畅；（4）总字数1000-1200字。"]],"qanswer":"zxtc","qerror":"zxtc","qsuccess":"zxtc","playnum":"0","successnum":"0","qdes":"zxtc","qdegree":"70","time":"1507708598","come":"历年真题","kaodian":"议论文写作题","accuracy":"100"},{"qid":"162","qcid":"1","qctypeid":"1","qtpath":"0-11-22-28","qtitle":"zxtc","qtid":"28","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["某单位今年新招收了30名职工。①新招收的职工里有人是外地的；②新招收的职工里，学历最高的不是外地人；③新招收的职工里有人不是外地的"],["如果上述三个判断中只有一个是真的，则下列哪项正确地表示了该单位新招收的职工中外地人的数量？"]],"qanswer":[["A.&nbsp;","只有1个人是外地人"],["B.&nbsp;30","名职工都是外地人"],["C.&nbsp;30","名职工都不是外地人"],["D.&nbsp;","只有1个人不是外地人"]],"qerror":"D","qsuccess":"B","playnum":"0","successnum":"0","qdes":[["正确答案是&nbsp;B，"],["来源"],["2016","年上考《行测》B卷真题2016"],["考点"],["反对关系"],["解析"],["真假推理。①\u201c新招收的职工里有人是外地的\u201d和③\u201c新招收的职工里有人不是外地的\u201d是反对关系，两句话必有一真，题干说三句话必有一真，说明唯一的真话在①和③两句话之间，则②\u201c新招收的职工里，学历最高的不是外地人\u201d一定为假，由此可以推出学历最高的是外地人，也就可以推出①\u201c新招收的职工里有人是外地的也是真的。因为只有一真，所以③\u201c新招收的职工里有人不是外地的\u201d就一定是假的，由此可以推出它的矛盾关系\u201c所有新招收的职工都是外地人\u201d是真的，只有B项可以推出。"]],"qdegree":"50","time":"1507892090","come":"历年真题","kaodian":"真假推理","accuracy":"100"},{"qid":"185","qcid":"1","qctypeid":"1","qtpath":"0-11-22-30","qtitle":"zxtc","qtid":"30","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["(","单选题",")","为保护海边建筑物免遭海洋风暴的袭击，海洋度假地在海滩和建筑物之间建起了巨大的防护墙。这些防护墙不仅遮住了一些建筑物的海景，而且使海岸本身也变窄了。这是因为在风暴从水的一边对沙子进行侵蚀的时候，沙子不再向内陆扩展。上述信息最支持的一项论断是（","&nbsp;&nbsp;&nbsp;&nbsp;","）。"]],"qanswer":[["A.&nbsp;","为后代保留下海滩应该是海岸管理的首要目标"],["B.&nbsp;","防护墙最终不会被风暴破坏，也不需要昂贵的维修和更新"],["C.&nbsp;","由于海洋风暴的猛烈程度不断加深，必须在海滩和海边建筑物之间建立起更多高大的防护墙"],["D.&nbsp;","通过建筑防护墙来保护海边建筑的努力，从长远来看作用是适得其反的"]],"qerror":"A","qsuccess":"D","playnum":"0","successnum":"0","qdes":[["正确答案是","&nbsp;D","。"],["来源"],["2005","年国家","(B","卷",")","《行测》真题","2005"],["考点"],["主题一致原则"],["解析"],["本题考察的是推出结论类题目，根据题干阐述，因为免遭风暴袭击，所以建立防护墙，建立防护墙，使得海岸变窄和遮住风景，因此能推出","D","项，长远看来作用可能适得其反。"],["纠错"],["A","项","\u201c","为后代保留下海滩应该是海岸管理的首要目标","\u201d","，题干没有提到是首要目标，主题不一致；","B","项，题干也没有提到维修与更新的问题，不能推出；","&nbsp;C","项说必须在海滩和海边建筑物之间建立起更多的高大的防护墙，题干中说防护墙产生了不好的结果，则","C","不符合题意。"],["拓展"],["在结论类题目中，主题不一致是经常会用到的原则，要注意审题，并将选项与题干进行比较以得出结论。"]],"qdegree":"50","time":"1507965609","come":"历年真题","kaodian":"归纳推理","accuracy":"100"},{"qid":"187","qcid":"1","qctypeid":"1","qtpath":"0-11-22-30","qtitle":"zxtc","qtid":"30","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["(","单选题",")","据有关调查，","70","％的中国家庭只要有了孩子就不养宠物，他们的观点是，宠物对孩子的健康有威胁。而一些西方国家几乎家家都有宠物，对于他们来说，宠物是孩子成长过程中不可缺少的玩伴。从这段文字可以推出（","&nbsp;&nbsp;&nbsp;&nbsp;","）。"]],"qanswer":[["A.&nbsp;","中国人对于孩子的关爱超过宠物"],["B.&nbsp;","西方人爱宠物甚于他们的孩子"],["C.&nbsp;","饲养宠物对于孩子来说，有利有弊，弊大于利"],["D.&nbsp;","中西方家庭对于饲养宠物的观念不一样"]],"qerror":"A","qsuccess":"D","playnum":"0","successnum":"0","qdes":[["正确答案是","&nbsp;D","，","&nbsp;","你没有回答这道题。"],["来源"],["2007","年江西《行测》真题","2007"],["考点"],["主题一致原则"],["解析"],["本题考查的是结论类中的主题一致原则。由中国家庭认为","\u201c","宠物对孩子的健康有威胁","\u201d","和西方家庭认为","\u201c","宠物是孩子成长过程中不可缺少的玩伴","\u201d","可以直接得到选项","D\u201c","中西方家庭对于饲养宠物的观念不一样","\u201d","。因此，本题答案为","D","选项。"],["纠错"],["A","、","B","、","C","三项为无由猜测，排除。"],["拓展"],["在结论类题目中，要注意四项基本原则：主题一致原则；排除无关概念原则；优先可能选项原则；慎选宏观论断原则。"]],"qdegree":"50","time":"1507966016","come":"历年真题","kaodian":"归纳推理","accuracy":"100"},{"qid":"191","qcid":"1","qctypeid":"1","qtpath":"0-11-22-37","qtitle":"zxtc","qtid":"37","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["在接受测谎器测验时，只要服用少量某种常用镇静剂，就可使人在说谎时不被察觉。因为由测谎器测出的心理压力反应可以通过药物抑制，而不会产生显著的副作用，由此推之，这种药物对降低日常生活中的心理压力也会很有效。此段话的假设前提是（"],["&nbsp;&nbsp;"],["）"]],"qanswer":[["A"],["．镇静剂对于治疗心理压力有效"],["B"],["．对于心理压力反应的抑制增加了主观的心理压力"],["C"],["．由测谎器测出的心理压力与日常生活的心理压力相似"],["D"],["．在测谎器测验中说谎的人经常显示出心理压力的迹象"]],"qerror":"D","qsuccess":"C","playnum":"0","successnum":"0","qdes":[["正确答案是"],["C"],["来源"],["2009"],["年上海《行测》真题"],["2009"],["考点"],["双观点"],["解析"],["题干由\u201c药物可以抑制由测谎器测出的心理压力\u201d得出\u201c药物可以降低日常生活中的心理压力\u201d的结论∶因此需要在\u201c测谎器测出的心理压力\u201d和\u201c日常生活中的心理压力\u201d两者之间建立联系，即"],["C"],["项是题干论证所必须假设的前提。其他各项作为前提都不能得出结论。"],["拓展"],["论证题目，一定要搞清楚论证范围，涉及到的论证对象，排除无关项，选出最佳答案。这需要考生务必掌握科学有效的方法，进而，多练习和勤总结，正确率才能不断得到提高。"]],"qdegree":"50","time":"1507967698","come":"历年真题","kaodian":"加强论证","accuracy":"100"},{"qid":"277","qcid":"1","qctypeid":"1","qtpath":"0-11-24","qtitle":"zxtc","qtid":"24","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["烈日∶蝉鸣"]],"qanswer":[["A.&nbsp;","飞雪∶梅花"],["B.&nbsp;","秋月∶蛇眠"],["C.&nbsp;","春风∶稻谷"],["D.&nbsp;","山洪∶海啸"]],"qerror":"D","qsuccess":"A","playnum":"0","successnum":"0","qdes":[["正确答案是&nbsp;A。"],["来源"],["2005","年江苏(C卷)《行测》真题2005"],["考点"],["对应关系"],["解析"],["本题考查的是逻辑关系中的对应关系。烈日指的是夏天，蝉在炎炎烈日下才会鸣叫，A选项中的梅花开在漫天飞雪的冬季，与题干逻辑关系对应。因此，本题答案为A选项。"],["纠错"],["B","项中的蛇眠在冬季，排除。C项中的词汇不具有题干词汇的逻辑关系，排除。D项中海啸不一定伴随着山洪，排除。"]],"qdegree":"70","time":"1507976296","come":"历年真题","kaodian":"类比推理","accuracy":"100"},{"qid":"279","qcid":"1","qctypeid":"1","qtpath":"0-11-24","qtitle":"zxtc","qtid":"24","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["运动"]],"qanswer":[["A.&nbsp;","压力"],["B.&nbsp;","按摩"],["C.&nbsp;","打磨"],["D.&nbsp;","检查"]],"qerror":"D","qsuccess":"C","playnum":"0","successnum":"0","qdes":[["正确答案是&nbsp;C，&nbsp;你没有回答这道题。"],["来源"],["2015","年山东《行测》真题2015"],["考点"],["主宾关系"],["解析"],["此题考查语法关系。运动消耗热量达到瘦身的目的，打磨去除瑕疵达到平滑的效果。因此选C。"]],"qdegree":"70","time":"1507976394","come":"历年真题","kaodian":"类比推理","accuracy":"100"},{"qid":"306","qcid":"1","qctypeid":"1","qtpath":"0-11-31","qtitle":"zxtc","qtid":"31","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["(","单选题"]],"qanswer":[["A.","今年开始吸烟的妇女多于已经戒烟的男子"],["B.","持续吸烟的人消费的烟草比往年更多"],["C.","今年开始嚼烟草吸鼻烟的人数多于已经戒烟的人数"],["D.","今年美国生产的香烟出口到其他国家的数量比去年多"]],"qerror":"C","qsuccess":"A","playnum":"0","successnum":"0","qdes":[["来源2005年上海《行测》真题2005"],["考点解释现象"],["解析"],["本题考查的是解释现象。在A项中，如果今年开始吸烟的妇女多于已经戒烟的男子，那么吸烟的人数在增加，与题干\u201c人数不断下降\u201d矛盾，不能成为支持题干现象的理由。因此，本题答案为A选项。"],["纠错"],["B","项单个人消费的增加，可以解释为什么吸烟的人数变少，但是烟农出售的烟草却增加了；C项表达了现今需要烟草的人数，仍然是在增加，所以可以解释题干的现象；D项美国生产的烟草，虽然在本国的销量降低，但是出口到国外的数量却增加了，所以仍然可以解释题干的现象。"],["拓展"],["在解释类题型中，解题时一定要抓住要解释的现象或矛盾，再根据要解释的现象或矛盾定位选项，选择正确的解释。"]],"qdegree":"90","time":"1507977986","come":"历年真题","kaodian":"原因解释","accuracy":"100"},{"qid":"310","qcid":"1","qctypeid":"1","qtpath":"0-11-31","qtitle":"zxtc","qtid":"31","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["(","单选题"],["安徽黄山是我国茶叶的主要产地之一，名茶种类很多。在黄山旅游时，导游总会在几个茶园停车，劝大家去里面参观，而且说买不买没关系，只要进去看看就可以。为此，一些游客常有怨念，但这种现象持续存在，甚至愈演愈烈。"],["以下哪项最不可能是造成这种现象的原因？"]],"qanswer":[["A.","游客在茶园购物，导游会得到提成"],["B.","虽然有的游客不愿意，但许多游客是愿意的，他们开心购物就是最好的证明"],["C.","到黄山旅游的游客在经济上很宽裕，他们只想省时间，进茶园可以批量采购"],["D.","有些游客外出旅游的任务之一就是购物，如果空手而归，会感觉玩得不高兴"]],"qerror":"A","qsuccess":"C","playnum":"0","successnum":"0","qdes":[["来源2015年河北公务员《行测》真题2015"],["考点解释矛盾"],["解析"],["解释矛盾。题干中的现象是，有些游客不满于导游带游客参观茶园购物，但参观活动仍持续存在，甚至愈演愈烈。A项指出导游可从中获益，因此热衷于带游客参观茶园购物，可以解释题干现象。B项指出许多游客愿意参观购物，说明有市场需求，可以解释题干现象。C项说到黄山的游客经济上很宽裕，只想省时间的情况，与题干所述\u201c一些游客有怨言\u201d的情况不符，故不可能是造成这种现象的原因。D项同样指出参观购物存在市场需求，能够解释题干现象。故本题选C。"]],"qdegree":"90","time":"1507978095","come":"历年真题","kaodian":"原因解释","accuracy":"100"},{"qid":"312","qcid":"1","qctypeid":"1","qtpath":"0-11-31","qtitle":"zxtc","qtid":"31","areaid":"1","qtgroup":"-1","qtype":"1","qcontent":[["(","单选题"]],"qanswer":[["A.","被调查的有125人"],["B.","有的被调查者后来改变了自己的观点"],["C.","有的被调查者认为事故的发生既有设备故障的原因，也有违章操作的原因"],["D.","很多认为原因不清的被调查者实际上有自己倾向性的判断，但是不愿意透露"]],"qerror":"A","qsuccess":"C","playnum":"0","successnum":"0","qdes":[["来源2009年河北《行测》真题2009"],["考点解释矛盾"],["解析"],["本题属于日常推理中的解释类题目，需要解释的是题干中描述的矛盾，是被调查的人总数超过了100%。C项中指出有的被调查者认为事故的发生既有设备故障的原因，也有违章操作的原因，即被调查者之间存在交集，很好的解释了矛盾出现的原因。因此，本题答案为C选项。"],["纠错"],["A","项中指出总人数为125人，并不能解释为什么人总数超过了100%，排除；B项中有的人改变了观点，但是对总人数不存在印象，无法解释矛盾，排除；D项中只是指出有些说自己并不清楚原因是不愿意透漏，和题目中的矛盾问题没有任何关系，排除。"],["拓展"],["解释类的题目属于或然性推理，根据题干中描述的问题，分为解释现象和解释矛盾两种。题干中出现和日常逻辑相违背的情况，产生矛盾，只要在符合日常逻辑的情况下，能合理的解释即可。"]],"qdegree":"90","time":"1507978155","come":"历年真题","kaodian":"原因解释","accuracy":"100"}]
     */

    private String code;
    private List<DataBean> data;

    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * qid : 33
         * qcid : 1
         * qctypeid : 1
         * qtpath : 0-4-20-76
         * qtitle : zxtc
         * qtid : 76
         * areaid : 1
         * qtgroup : -1
         * qtype : 1
         * qcontent : [["①中国是玉米主要生产国之一，栽培面积和总产量仅次于美国"],["②玉米营养丰富，是农作物中热量最高的粮食，人们称之为\u201c饲料作物之王\u201d"],["③明末清初中国人口从1亿增至4亿，玉米功不可没"],["④现今，全世界约70%的玉米用以发展畜牧业，以换取肉、奶、蛋等生活必需品"],["⑤学者曾把人均玉米数量视为一个国家畜牧业发展和人民生活水平的重要标志"],["⑥明末清初时玉米传入中国，许多无法种植小麦的早旱、贫瘠之地也可开垦种植玉米，且产量比小麦高"],["将以上6个句子重新排列，语序正确的是："]]
         * qanswer : [["A.","⑥③④①②⑤"],["B.","①②④③⑥⑤"],["C.","②④⑤①⑥③"],["D.","④⑤②①③⑥"]]
         * qerror : A
         * qsuccess : C
         * playnum : 0
         * successnum : 0
         * qdes : [["【思路点拨】本题是一道语句排序题。做题时需要从观察选项入手，然后猜定选项，最后验证猜定选项连贯性。常用的方法有判断首句、绑定选项和注意文章写作顺序等。"],["【选项解析】"]]
         * qdegree : 50
         * time : 1507619057
         * come : 历年真题
         * kaodian : 语句排序题
         * accuracy : 100
         */

        private String qid;
        private String qcid;
        private String qctypeid;
        private String qtpath;
        private String qtitle;
        private String qtid;
        private String areaid;
        private String qtgroup;
        private String qtype;
        private String qerror;
        private String qsuccess;
        private String playnum;
        private String successnum;
        private String qdegree;
        private String time;
        private String come;
        private String kaodian;
        private String accuracy;
        private List<List<String>> qcontent;
        private List<List<String>> qanswer;
        private List<List<String>> qdes;

        public String getQid() {
            return qid;
        }

        public void setQid(String qid) {
            this.qid = qid;
        }

        public String getQcid() {
            return qcid;
        }

        public void setQcid(String qcid) {
            this.qcid = qcid;
        }

        public String getQctypeid() {
            return qctypeid;
        }

        public void setQctypeid(String qctypeid) {
            this.qctypeid = qctypeid;
        }

        public String getQtpath() {
            return qtpath;
        }

        public void setQtpath(String qtpath) {
            this.qtpath = qtpath;
        }

        public String getQtitle() {
            return qtitle;
        }

        public void setQtitle(String qtitle) {
            this.qtitle = qtitle;
        }

        public String getQtid() {
            return qtid;
        }

        public void setQtid(String qtid) {
            this.qtid = qtid;
        }

        public String getAreaid() {
            return areaid;
        }

        public void setAreaid(String areaid) {
            this.areaid = areaid;
        }

        public String getQtgroup() {
            return qtgroup;
        }

        public void setQtgroup(String qtgroup) {
            this.qtgroup = qtgroup;
        }

        public String getQtype() {
            return qtype;
        }

        public void setQtype(String qtype) {
            this.qtype = qtype;
        }

        public String getQerror() {
            return qerror;
        }

        public void setQerror(String qerror) {
            this.qerror = qerror;
        }

        public String getQsuccess() {
            return qsuccess;
        }

        public void setQsuccess(String qsuccess) {
            this.qsuccess = qsuccess;
        }

        public String getPlaynum() {
            return playnum;
        }

        public void setPlaynum(String playnum) {
            this.playnum = playnum;
        }

        public String getSuccessnum() {
            return successnum;
        }

        public void setSuccessnum(String successnum) {
            this.successnum = successnum;
        }

        public String getQdegree() {
            return qdegree;
        }

        public void setQdegree(String qdegree) {
            this.qdegree = qdegree;
        }

        public String getTime() {
            return time;
        }

        public void setTime(String time) {
            this.time = time;
        }

        public String getCome() {
            return come;
        }

        public void setCome(String come) {
            this.come = come;
        }

        public String getKaodian() {
            return kaodian;
        }

        public void setKaodian(String kaodian) {
            this.kaodian = kaodian;
        }

        public String getAccuracy() {
            return accuracy;
        }

        public void setAccuracy(String accuracy) {
            this.accuracy = accuracy;
        }

        public List<List<String>> getQcontent() {
            return qcontent;
        }

        public void setQcontent(List<List<String>> qcontent) {
            this.qcontent = qcontent;
        }

        public List<List<String>> getQanswer() {
            return qanswer;
        }

        public void setQanswer(List<List<String>> qanswer) {
            this.qanswer = qanswer;
        }

        public List<List<String>> getQdes() {
            return qdes;
        }

        public void setQdes(List<List<String>> qdes) {
            this.qdes = qdes;
        }
    }
}
